controllers/LibraryController.php

SELECT * FROM `library` WHERE id_user = 0 AND id_owner != 2
---
    public function actionAvailable()
    {
        $this->view->title = "Свободные диски";
        $data = Library::find()
                            ->where("id_user = 0 AND id_owner != ".Yii::$app->user->id)
                            ->all();

SELECT * FROM `library` WHERE `id_owner`=1
---
    public function actionIndex()
    {
        $this->view->title = "Моя коллекция";
        $data = Library::find()
                            ->where(['id_owner'=>Yii::$app->user->id])
                            ->all();

SELECT * FROM `library` WHERE `id_user`=1
---
    public function actionMyself()
    {
        $this->view->title = "Взятые мной";
        $data = Library::find()
                            ->where(['id_user'=>Yii::$app->user->id])
                            ->all();

SELECT * FROM `library` WHERE id_owner = 1 AND id_user>0
---
    public function actionAnother()
    {
        $this->view->title = "Взятые у меня";
        $data = Library::find()
                            ->with('users')
                            ->where("id_owner = ".Yii::$app->user->id." AND id_user>0")
                            ->all();

SELECT * FROM `library` WHERE id = '1'
UPDATE `library` SET `id_user`=2 WHERE `id`=1
---
    public function actionGet($id)
    {
        $disk = Library::find()
                            ->where("id = :id", ['id'=>$id])
                            ->one();
        $disk->id_user = Yii::$app->user->id;
        $disk->save(false);

SELECT * FROM `library` WHERE id = '2'
UPDATE `library` SET `id_user`=0 WHERE `id`=2
---
    public function actionBack($id)
    {
        $disk = Library::find()->where("id = :id", ['id'=>$id])->one();
        print_r($disk);
        $disk->id_user = 0;
        $disk->save(false);