models/Users.php

SELECT * FROM `users` WHERE `login`='lexbond'
---
    public function getUser()
     {
       if ($this->user === false) {
        $this->user = Users::findOne(['login'=>$this->login]);

SELECT * FROM `users` WHERE `id`=2
---
        public static function findIdentity($id)
    {
        return static::findOne($id);